# 1. Data Frame
## 1.1. Tạo `dataframe`

In [1]:
students_1 = data.frame('name'=c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom'),
                       'age'=c(17, 16, 17, 18, 19, 16),
                       'mark'=c(9, 9, 8, 7.5, 7.5, 8),
                       stringsAsFactors=FALSE)

students_1

  name   age mark
1 Hellen 17  9.0
2 Jolie  16  9.0
3 Kiwi   17  8.0
4 John   18  7.5
5 Mark   19  7.5
6 Tom    16  8.0

In [2]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)

students = data.frame(name, age, mark, stringsAsFactors=FALSE)

students

  name   age mark
1 Hellen 17  9.0
2 Jolie  16  9.0
3 Kiwi   17  8.0
4 John   18  7.5
5 Mark   19  7.5
6 Tom    16  8.0

## 1.2. Xem cấu trúc của `dataframe`

In [3]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

str(students)

'data.frame':	6 obs. of  3 variables:
 $ name: chr  "Hellen" "Jolie" "Kiwi" "John" ...
 $ age : num  17 16 17 18 19 16
 $ mark: num  9 9 8 7.5 7.5 8

## 1.3. Xem thống kê tóm tắt của dữ liệu

In [4]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

summary(students)

     name                age             mark
 Length:6           Min.   :16.00   Min.   :7.500
 Class :character   1st Qu.:16.25   1st Qu.:7.625
 Mode  :character   Median :17.00   Median :8.000
                    Mean   :17.17   Mean   :8.167
                    3rd Qu.:17.75   3rd Qu.:8.750
                    Max.   :19.00   Max.   :9.000

## 1.3. Truy xuất dữ liệu từ `dataframe`

In [5]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

students$mark

[1] 9.0 9.0 8.0 7.5 7.5 8.0

In [6]:
students[1:2, ]

  name   age mark
1 Hellen 17  9
2 Jolie  16  9

* Get `age` column as `dataframe`

In [7]:
tmp = data.frame(students$age)
tmp

  students.age
1 17
2 16
3 17
4 18
5 19
6 16

In [8]:
students[c(3, 5), c(1, 2)]

  name age
3 Kiwi 17
5 Mark 19

## 1.4. Thêm một cột mới vào `dataframe`

In [9]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

students$class = c('Toán', 'Lí', 'Hóa', 'Văn', 'Sử', 'Địa')

students

  name   age mark class
1 Hellen 17  9.0  Toán
2 Jolie  16  9.0  Lí
3 Kiwi   17  8.0  Hóa
4 John   18  7.5  Văn
5 Mark   19  7.5  Sử
6 Tom    16  8.0  Địa

In [10]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

country = c('Mỹ', 'Anh', 'Pháp', 'Nga', 'Nhật', 'Hàn')
students = cbind(students, country)

students

  name   age mark country
1 Hellen 17  9.0  Mỹ
2 Jolie  16  9.0  Anh
3 Kiwi   17  8.0  Pháp
4 John   18  7.5  Nga
5 Mark   19  7.5  Nhật
6 Tom    16  8.0  Hàn

# 1.5. Thêm dòng

In [11]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

new_student = data.frame(name=c('Cường', 'Tèo'), age=c(22, 22), mark=c(10, 10), stringsAsFactors=FALSE)
students = rbind(students, new_student)

students

  name   age mark
1 Hellen 17   9.0
2 Jolie  16   9.0
3 Kiwi   17   8.0
4 John   18   7.5
5 Mark   19   7.5
6 Tom    16   8.0
7 Cường  22  10.0
8 Tèo    22  10.0

In [14]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

new_student_2 = list('Cường', 22, 10)
students = rbind(students, new_student_2)

students

  name   age mark
1 Hellen 17   9.0
2 Jolie  16   9.0
3 Kiwi   17   8.0
4 John   18   7.5
5 Mark   19   7.5
6 Tom    16   8.0
7 Cường  22  10.0

## 1.6. Đổi tên cột

In [15]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

names(students)[names(students) == 'mark'] = 'score'

students

  name   age score
1 Hellen 17  9.0
2 Jolie  16  9.0
3 Kiwi   17  8.0
4 John   18  7.5
5 Mark   19  7.5
6 Tom    16  8.0

## 1.7. In vài dòng đầu và vài dòng cuối

In [16]:
name = c('Hellen', 'Jolie', 'Kiwi', 'John', 'Mark', 'Tom')
age = c(17, 16, 17, 18, 19, 16)
mark = c(9, 9, 8, 7.5, 7.5, 8)
students = data.frame(name, age, mark, stringsAsFactors=FALSE)

In [17]:
head(students)

  name   age mark
1 Hellen 17  9.0
2 Jolie  16  9.0
3 Kiwi   17  8.0
4 John   18  7.5
5 Mark   19  7.5
6 Tom    16  8.0

In [18]:
tail(students)

  name   age mark
1 Hellen 17  9.0
2 Jolie  16  9.0
3 Kiwi   17  8.0
4 John   18  7.5
5 Mark   19  7.5
6 Tom    16  8.0

# 2. Tidyverse
## 2.1. Install

In [22]:
install.packages('tidyverse')
install.packages('httpuv') # cài chơi ko sài trog bài này

Installing package into ‘/home/manhcuong/R/x86_64-pc-linux-gnu-library/4.1’
(as ‘lib’ is unspecified)

Installing package into ‘/home/manhcuong/R/x86_64-pc-linux-gnu-library/4.1’
(as ‘lib’ is unspecified)

## 2.2. Import

In [21]:
library(tidyverse)

## 2.3. Load dữ liệu `pokemon`

In [25]:
pokemon = read.csv('./data/pokemon.csv')

head(pokemon)

  X. Name                  Type.1 Type.2 Total HP Attack Defense Sp..Atk
1 1  Bulbasaur             Grass  Poison 318   45  49     49      65
2 2  Ivysaur               Grass  Poison 405   60  62     63      80
3 3  Venusaur              Grass  Poison 525   80  82     83     100
4 3  VenusaurMega Venusaur Grass  Poison 625   80 100    123     122
5 4  Charmander            Fire          309   39  52     43      60
6 5  Charmeleon            Fire          405   58  64     58      80
  Sp..Def Speed Generation Legendary
1  65     45    1          False
2  80     60    1          False
3 100     80    1          False
4 120     80    1          False
5  50     65    1          False
6  65     80    1          False

In [26]:
str(pokemon)

'data.frame':	800 obs. of  13 variables:
 $ X.        : int  1 2 3 3 4 5 6 6 6 7 ...
 $ Name      : chr  "Bulbasaur" "Ivysaur" "Venusaur" "VenusaurMega Venusaur" ...
 $ Type.1    : chr  "Grass" "Grass" "Grass" "Grass" ...
 $ Type.2    : chr  "Poison" "Poison" "Poison" "Poison" ...
 $ Total     : int  318 405 525 625 309 405 534 634 634 314 ...
 $ HP        : int  45 60 80 80 39 58 78 78 78 44 ...
 $ Attack    : int  49 62 82 100 52 64 84 130 104 48 ...
 $ Defense   : int  49 63 83 123 43 58 78 111 78 65 ...
 $ Sp..Atk   : int  65 80 100 122 60 80 109 130 159 50 ...
 $ Sp..Def   : int  65 80 100 120 50 65 85 85 115 64 ...
 $ Speed     : int  45 60 80 80 65 80 100 100 100 43 ...
 $ Generation: int  1 1 1 1 1 1 1 1 1 1 ...
 $ Legendary : chr  "False" "False" "False" "False" ...

## 2.4. Thao tác với Tidyverse
### 2.4.1. Chọn cột với `select()`

In [28]:
pokemon_sub = select(pokemon, c(2, 5, 7, 8))

head(pokemon_sub)

  Name                  Total Attack Defense
1 Bulbasaur             318    49     49
2 Ivysaur               405    62     63
3 Venusaur              525    82     83
4 VenusaurMega Venusaur 625   100    123
5 Charmander            309    52     43
6 Charmeleon            405    64     58

In [29]:
pokemon_sub = select(pokemon, c('Name', 'Total', 'Attack', 'Defense'))

head(pokemon_sub)

  Name                  Total Attack Defense
1 Bulbasaur             318    49     49
2 Ivysaur               405    62     63
3 Venusaur              525    82     83
4 VenusaurMega Venusaur 625   100    123
5 Charmander            309    52     43
6 Charmeleon            405    64     58

In [31]:
pokemon_sub = pokemon %>% select(Name, Total, Attack, Defense)

head(pokemon_sub)

  Name                  Total Attack Defense
1 Bulbasaur             318    49     49
2 Ivysaur               405    62     63
3 Venusaur              525    82     83
4 VenusaurMega Venusaur 625   100    123
5 Charmander            309    52     43
6 Charmeleon            405    64     58

### 2.4.2. Chọn cột với `select_if(<dataframe>, <hàm điều kiện>)`

In [32]:
pokemon_numbers = select_if(pokemon, is.numeric)

head(pokemon_numbers)

  X. Total HP Attack Defense Sp..Atk Sp..Def Speed Generation
1 1  318   45  49     49      65      65     45    1
2 2  405   60  62     63      80      80     60    1
3 3  525   80  82     83     100     100     80    1
4 3  625   80 100    123     122     120     80    1
5 4  309   39  52     43      60      50     65    1
6 5  405   58  64     58      80      65     80    1

### 2.4.3. Chọn dòng với `filter()`

In [36]:
pokemon_sub = pokemon %>% select(Name, Total, Attack, Defense)
pokemon_500_600 = pokemon_sub %>% filter(Total >= 500, Total <= 600)

head(pokemon_500_600)

  Name                Total Attack Defense
1 Venusaur            525    82     83
2 Charizard           534    84     78
3 Blastoise           530    83    100
4 PidgeotMega Pidgeot 579    80     80
5 Nidoqueen           505    92     87
6 Nidoking            505   102     77

In [39]:
pokemon_500_600 = filter(pokemon_sub, Total >= 500 & Total <= 600)

head(pokemon_500_600)

  Name                Total Attack Defense
1 Venusaur            525    82     83
2 Charizard           534    84     78
3 Blastoise           530    83    100
4 PidgeotMega Pidgeot 579    80     80
5 Nidoqueen           505    92     87
6 Nidoking            505   102     77

### 2.4.4. Tạo cột mới với `mutate(<dataframe>, <điều kiện>)`

In [41]:
pokemon_sub = pokemon %>% select(Name, Total, Attack, Defense)
pokemon_sub = mutate(pokemon_sub, Compare = ifelse(Attack > Defense, 1, 0))

head(pokemon_sub)

  Name                  Total Attack Defense Compare
1 Bulbasaur             318    49     49     0
2 Ivysaur               405    62     63     0
3 Venusaur              525    82     83     0
4 VenusaurMega Venusaur 625   100    123     0
5 Charmander            309    52     43     1
6 Charmeleon            405    64     58     1

### 2.4.5. Sắp xếp dữ liệu với `arrange(<dataframe>, <điều kiện>)`, mặc định là tăng dần

In [42]:
pokemon_sub = pokemon %>% select(Name, Total, Attack, Defense)
pokemon_sub = mutate(pokemon_sub, Compare = ifelse(Attack > Defense, 1, 0))

head(arrange(pokemon_sub, Total))

  Name      Total Attack Defense Compare
1 Sunkern   180   30     30      0
2 Azurill   190   20     40      0
3 Kricketot 194   25     41      0
4 Caterpie  195   30     35      0
5 Weedle    195   35     30      1
6 Wurmple   195   45     35      1

* Sắp xếp giảm dần

In [43]:
head(arrange(pokemon_sub, desc(Total)))

  Name                  Total Attack Defense Compare
1 MewtwoMega Mewtwo X   780   190    100     1
2 MewtwoMega Mewtwo Y   780   150     70     1
3 RayquazaMega Rayquaza 780   180    100     1
4 KyogrePrimal Kyogre   770   150     90     1
5 GroudonPrimal Groudon 770   180    160     1
6 Arceus                720   120    120     0

* Sắp xếp trên nhiều cột

In [44]:
head(arrange(pokemon_sub, desc(Total), Attack))

  Name                  Total Attack Defense Compare
1 MewtwoMega Mewtwo Y   780   150     70     1
2 RayquazaMega Rayquaza 780   180    100     1
3 MewtwoMega Mewtwo X   780   190    100     1
4 KyogrePrimal Kyogre   770   150     90     1
5 GroudonPrimal Groudon 770   180    160     1
6 Arceus                720   120    120     0

### 2.4.6. Thống kê với `summarize()`, `group_by()`

In [48]:
group = group_by(pokemon, Type.1)
summary_type1 = summarize(group,
                   count=n(),
                   mean.Attack=mean(Attack, na.rm=T),
                   median.Attack=median(Attack, na.rm=T),
                   mean.Defense=mean(Defense, na.rm=T),
                   median.Defense=median(Defense, na.rm=T))

summary_type1

   Type.1   count mean.Attack median.Attack mean.Defense median.Defense
1  Bug       69    70.97101    65.0          70.72464     60.0
2  Dark      31    88.38710    88.0          70.22581     70.0
3  Dragon    32   112.12500   113.5          86.37500     90.0
4  Electric  44    69.09091    65.0          66.29545     65.0
5  Fairy     17    61.52941    52.0          65.70588     66.0
6  Fighting  27    96.77778   100.0          65.92593     70.0
7  Fire      52    84.76923    84.5          67.76923     64.0
8  Flying     4    78.75000    85.0          66.25000     75.0
9  Ghost     32    73.78125    66.0          81.18750     72.5
10 Grass     70    73.21429    70.0          70.80000     66.0
11 Ground    32    95.75000    85.0          84.84375     84.5
12 Ice       24    72.75000    67.0          71.41667     75.0
13 Normal    98    73.46939    70.5          59.84694     60.0
14 Poison    28    74.67857    74.0          68.82143     67.0
15 Psychic   57    71.45614    57.0          67.68421     65.0
16 Rock      44    92.86364    95.0         100.79545    100.0
17 Steel     27    92.70370    89.0         126.37037    120.0
18 Water    112    74.15179    72.0          72.94643     70.0